module.exports = {
    name: "القائمة",
    aliases: ["مساعدة", "اوامر", "الاوامر"],
    description: "يعرض قائمة الأوامر المتاحة",
    async execute(sock, msg, args) {
        const menuText = `
*•───⋅*『 قائمة أوامر بوت جمايكا: 』*⋅───•*
*•──────⋅ ☽ 👻 ☾ ⋅──────•*

*» الأوامر العامة:*
- .حول
- .الوقت
- .التاريخ
- .الطقس [المدينة]
- .اقتباس
- .نكتة

*•──────⋅ ☽ 🎬 ☾ ⋅──────•*
*» أوامر الصور والفيديو:*
- .ميمز
- .انمي
- .رومانسي
- .حزين
- .تنزيل [الرابط]

*•──────⋅ ☽ 👰‍♀️ ☾ ⋅──────•*
*» أوامر التفاعل والتسلية:*
- .زواج
- .طلاق
- .موعد
- .تجسس
- .قلب

*•──────⋅ ☽ 👨‍💻 ☾ ⋅──────•*
*» أوامر المطور:*
- .حظر
- .فك_الحظر
- .اذاعة
- .إعادة_تشغيل
- .رفع_مشرف
- .تنزيل_مشرف

*•──────⋅ ☽ 🤴 ☾ ⋅──────•*
*» أوامر VIP:*
- .اضافة_vip
- .حذف_vip
- .قائمة_vip
- .مساعدة_vip

*•──────⋅ ☽ ⚙️ ☾ ⋅──────•*
*» الحماية والإدارة:*
- .قفل_الجروب
- .فتح_الجروب
- .منع_الروابط
- .انذار
- .طرد
- .كتم
- .فك_الكتم
- .قائمة_سوداء

*•──────⋅ ☽ 🤖 ☾ ⋅──────•*
*» أخرى:*
- .شكوى
- .عرض_الشكاوى
- .الدعم

*•──────⋅ ☽ ☠️ ☾ ⋅──────•*
*البوت:* جمايكا
*المطور:* روني البحيره
*رقم المطور:* 01222843252
        `;
        await sock.sendMessage(msg.key.remoteJid, { text: menuText }, { quoted: msg });
    }
};